app/controllers/users_controller.rb

  def create
    @user = User.new(permited_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email_address", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"